# ~/.Brewfile
# Run following command to install packages.
# brew bundle --global
tap "beeftornado/rmtree"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# Checks for bashisms in shell scripts
brew "checkbashisms"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Improved top (interactive process viewer)
brew "htop"
# Mac App Store command-line interface
brew "mas"
# Remote terminal application
brew "mosh"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
cask "alfred"
cask "balenaetcher"
cask "bitwarden"
cask "brooklyn"
cask "cyberduck"
cask "docker"
cask "firefox"
cask "font-d2coding"
cask "font-fira-code"
cask "font-hack"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "logitech-options"
cask "mattermost"
cask "notion"
cask "opera"
cask "slack"
cask "the-unarchiver"
cask "typora"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vivaldi"
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "NateOn", id: 501556811
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
mas "카카오톡", id: 869223134
